In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.369004 -1.058174 -0.878816 -0.253205
2013-01-02  0.354337 -0.567755 -0.137315  0.080467
2013-01-03  0.106912  1.055725 -0.871979  0.862509
2013-01-04 -1.447061 -0.434521 -1.102565  0.303725
2013-01-05  0.123249  0.594800 -0.548939 -0.256102
2013-01-06  0.075939  0.482233 -0.765433  0.520252

In [8]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df2.D.abs

<bound method NDFrame.abs of 0    3
1    3
2    3
3    3
Name: D, dtype: int32>

In [11]:
df.head()

                   A         B         C         D
2013-01-01 -0.369004 -1.058174 -0.878816 -0.253205
2013-01-02  0.354337 -0.567755 -0.137315  0.080467
2013-01-03  0.106912  1.055725 -0.871979  0.862509
2013-01-04 -1.447061 -0.434521 -1.102565  0.303725
2013-01-05  0.123249  0.594800 -0.548939 -0.256102

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.447061 -0.434521 -1.102565  0.303725
2013-01-05  0.123249  0.594800 -0.548939 -0.256102
2013-01-06  0.075939  0.482233 -0.765433  0.520252

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.values

array([[-0.36900438, -1.05817387, -0.87881617, -0.25320527],
       [ 0.35433729, -0.56775548, -0.1373154 ,  0.08046712],
       [ 0.10691182,  1.0557251 , -0.87197927,  0.86250907],
       [-1.44706107, -0.43452146, -1.10256536,  0.30372501],
       [ 0.12324909,  0.59479969, -0.54893858, -0.25610215],
       [ 0.07593876,  0.48223298, -0.76543335,  0.52025224]])

In [16]:
df2.describe

<bound method NDFrame.describe of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [17]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [18]:
df2.sort_index(axis=1, ascending=0)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01 -0.369004 -1.058174 -0.878816 -0.253205
2013-01-02  0.354337 -0.567755 -0.137315  0.080467
2013-01-04 -1.447061 -0.434521 -1.102565  0.303725
2013-01-06  0.075939  0.482233 -0.765433  0.520252
2013-01-05  0.123249  0.594800 -0.548939 -0.256102
2013-01-03  0.106912  1.055725 -0.871979  0.862509

In [20]:
df['A']

2013-01-01   -0.369004
2013-01-02    0.354337
2013-01-03    0.106912
2013-01-04   -1.447061
2013-01-05    0.123249
2013-01-06    0.075939
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.369004 -1.058174 -0.878816 -0.253205
2013-01-02  0.354337 -0.567755 -0.137315  0.080467
2013-01-03  0.106912  1.055725 -0.871979  0.862509

In [22]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.354337 -0.567755 -0.137315  0.080467
2013-01-03  0.106912  1.055725 -0.871979  0.862509
2013-01-04 -1.447061 -0.434521 -1.102565  0.303725

In [23]:
df2[df2.A > 0]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [24]:
df[df < 0]

                   A         B         C         D
2013-01-01 -0.369004 -1.058174 -0.878816 -0.253205
2013-01-02       NaN -0.567755 -0.137315       NaN
2013-01-03       NaN       NaN -0.871979       NaN
2013-01-04 -1.447061 -0.434521 -1.102565       NaN
2013-01-05       NaN       NaN -0.548939 -0.256102
2013-01-06       NaN       NaN -0.765433       NaN